; domain
(define (domain JTFK)
    (:requirements :typing :negative-preconditions ) 
    
    (:types
      STIR - object
      Target - object
      GUN - object
      SAM - object
      Missile - object
    )

    (:predicates
      (exist ?sti - STIR)
      (locked ?sti - STIR)
      (lockon ?sti - STIR ?tar - Target)

      (appeared ?tar - Target)
      (searched ?tar - Target)
      (destroyed ?tar - Target)

      (gaimed ?gun - GUN)
      (fired ?gun - GUN)
      (gsurvice ?gun - GUN ?sti - STIR)
      (gaimto ?gun - GUN ?tar - Target)

      (armempty ?sam - SAM)
      (aimed ?sam - SAM)
      (survice ?sam - SAM ?sti - STIR)
      (aimto ?sam - SAM ?tar - Target)

      (loaded ?mis - Missile)
      (launched ?mis - Missile)
      (boom ?mis - Missile)
      (onlaunch ?sam - SAM ?mis - Missile)
      (directto ?sti - STIR ?mis - Missile)
      (interceptto ?mis - Missile ?tar - Target) 
    )

    (:action appear
     :parameters (?tar - Target)
     :precondition 
       (and
         (not (appeared ?tar))
         (not (destroyed ?tar))
         (not (searched ?tar))
       )
     :effect
       (and
         (appeared ?tar)
         (not (destroyed ?tar))
         (not (searched ?tar))
       )
    )

    (:action search
     :parameters (?tar - Target ?sti - STIR)
     :precondition 
       (and
         (appeared ?tar)
         (not (searched ?tar))
         (not (destroyed ?tar))
         (not (locked ?sti))
         (not (exist ?sti))
       )
     :effect
       (and
         (appeared ?tar)
         (searched ?tar)
         (not (destroyed ?tar))
         (exist ?sti)
       )
    )

    (:action lockgun
     :parameters (?sti - STIR ?g1 - GUN ?tar - Target)
     :precondition 
       (and
         (exist ?sti)
         (searched ?tar)
         (not (destroyed ?tar))
         (not (locked ?sti))
         (not (gaimed ?g1))
       )
     :effect
       (and
         (locked ?sti)
         (lockon ?sti ?tar)
         (gsurvice ?g1 ?sti)
         (gaimed ?g1)
         (gaimto ?g1 ?tar)
       )
    )

    (:action KAG
     :parameters (?tar - Target ?g1 - GUN)
     :precondition(and
        (gaimed ?g1)
        (gaimto ?g1 ?tar)
        (not (fired ?g1))
        (not (destroyed ?tar))
     )
     :effect(and
        (fired ?g1)
        (destroyed ?tar)
        (not (gaimed ?g1))
        (not (gaimto ?g1 ?tar))
     )
    )

    (:action ghand_off
     :parameters (?g1 - GUN ?sti - STIR ?tar - Target)
     :precondition 
       (and
         (gsurvice ?g1 ?sti)
         (locked ?sti)
         (lockon ?sti ?tar)
         (fired ?g1)
         (destroyed ?tar)
       )
     :effect
       (and
         (not (gsurvice ?g1 ?sti))
         (not (locked ?sti))
         (not (lockon ?sti ?tar))
         (not (fired ?g1))
       )
    )

    (:action fill_in
     :parameters (?sam - SAM ?mis - Missile)
     :precondition 
       (and
         (armempty ?sam)
         (not (aimed ?sam))
         (not (loaded ?mis))
         (not (launched ?mis))
       )
     :effect
       (and
         (not (armempty ?sam))
         (loaded ?mis)
         (onlaunch ?sam ?mis)
       )
    )

    (:action lock
     :parameters (?sti - STIR ?sam - SAM ?tar - Target ?mis - Missile)
     :precondition 
       (and
         (not (armempty ?sam))
         (not (aimed ?sam))
         (onlaunch ?sam ?mis)
         (loaded ?mis)
         (not (launched ?mis))
         (exist ?sti)
         (not (locked ?sti))
         (searched ?tar)
         (not (destroyed ?tar))
       )
     :effect
       (and
         (locked ?sti)
         (lockon ?sti ?tar)
         (survice ?sam ?sti)
         (aimed ?sam)
         (aimto ?sam ?tar)
       )
    )

    (:action launch
        :parameters (?sam - SAM ?mis - Missile ?tar - Target ?sti - STIR)
        :precondition (and 
          (aimed ?sam)
          (aimto ?sam ?tar)
          (onlaunch ?sam ?mis)
          (loaded ?mis)
          (not (launched ?mis))
          (not (boom ?mis))
          (survice ?sam ?sti)
          (lockon ?sti ?tar)
          (searched ?tar)
        )
        :effect (and 
          (directto ?sti ?mis)
          (launched ?mis)
          (interceptto ?mis ?tar)
          (armempty ?sam)
        )
    )
    

    ; (:action mforward
    ;  :parameters (?mis - Missile ?tar - Target)
    ;  :precondition 
    ;    (and
    ;      (launched ?mis)
    ;      (interceptto ?mis ?tar)
    ;      (not (boom ?mis))
    ;    )
    ;  :effect
    ;    (and
    ;      (launched ?mis)
    ;      (not (boom ?mis))
    ;    )
    ; )

    (:action KA
     :parameters (?mis - Missile ?tar - Target)
     :precondition 
       (and
         (appeared ?tar)
         (searched ?tar)
         (not (destroyed ?tar))
         (launched ?mis)
         (not (boom ?mis))
         (interceptto ?mis ?tar)
       )
     :effect
       (and
         (boom ?mis)
         (destroyed ?tar)
       )
    )
        
    (:action hand_off
     :parameters (?sti - STIR ?sam - SAM ?tar - Target ?mis - Missile)
     :precondition 
       (and
         (locked ?sti)
         (lockon ?sti ?tar)
         (survice ?sam ?sti)
         (directto ?sti ?mis)
         (boom ?mis)
         (exist ?sti)
       )
     :effect
       (and
         (not (locked ?sti))
         (not (lockon ?sti ?tar))
         (not (survice ?sam ?sti))
         (not (directto ?sti ?mis))
         (not (exist ?sti))
         (not (aimed ?sam))
       )
    )
)

; problem
(define (problem JTFK_Problem)
    (:domain JTFK)
    (:objects
      sti1 - STIR
      gun1 - GUN
      sam1 - SAM
      mis1 - Missile
      mis2 - Missile
      tar1 - Target
      tar2 - Target
      tar3 - Target
    )
    (:init
      (armempty sam1)
    )
      
    (:goal
      (and
        (destroyed tar1)
        (destroyed tar2)
        (destroyed tar3)
        (boom mis1)
        (boom mis2)
        (not (locked sti1))
      )
    )
)

; plan
1. (appear tar1)
   added: (appeared tar1)
   goals met: 1 of 6
2. (appear tar2)
   added: (appeared tar2)
   goals met: 1 of 6
3. (appear tar3)
   added: (appeared tar3)
   goals met: 1 of 6
4. (fill_in sam1 mis2)
   deleted: (armempty sam1)
   added: (loaded mis2) (onlaunch sam1 mis2)
   goals met: 1 of 6
5. (search tar1 sti1)
   added: (searched tar1) (exist sti1)
   goals met: 1 of 6
6. (lock sti1 sam1 tar1 mis2)
   added: (locked sti1) (lockon sti1 tar1) (survice sam1 sti1) (aimed sam1) (aimto sam1 tar1)
   goals met: 0 of 6
7. (launch sam1 mis2 tar1 sti1)
   added: (directto sti1 mis2) (launched mis2) (interceptto mis2 tar1) (armempty sam1)
   goals met: 0 of 6
8. (ka mis2 tar1)
   added: (boom mis2) (destroyed tar1)
   goals met: 2 of 6
9. (hand_off sti1 sam1 tar1 mis2)
   deleted: (locked sti1) (lockon sti1 tar1) (survice sam1 sti1) (directto sti1 mis2) (exist sti1) (aimed sam1)
   goals met: 3 of 6
10. (fill_in sam1 mis1)
   deleted: (armempty sam1)
   added: (loaded mis1) (onlaunch sam1 mis1)
   goals met: 3 of 6
11. (search tar3 sti1)
   added: (searched tar3) (exist sti1)
   goals met: 3 of 6
12. (lock sti1 sam1 tar3 mis1)
   added: (locked sti1) (lockon sti1 tar3) (survice sam1 sti1) (aimed sam1) (aimto sam1 tar3)
   goals met: 2 of 6
13. (launch sam1 mis1 tar3 sti1)
   added: (directto sti1 mis1) (launched mis1) (interceptto mis1 tar3) (armempty sam1)
   goals met: 2 of 6
14. (ka mis1 tar3)
   added: (boom mis1) (destroyed tar3)
   goals met: 4 of 6
15. (hand_off sti1 sam1 tar3 mis1)
   deleted: (locked sti1) (lockon sti1 tar3) (survice sam1 sti1) (directto sti1 mis1) (exist sti1) (aimed sam1)
   goals met: 5 of 6
16. (search tar2 sti1)
   added: (searched tar2) (exist sti1)
   goals met: 5 of 6
17. (lockgun sti1 gun1 tar2)
   added: (locked sti1) (lockon sti1 tar2) (gsurvice gun1 sti1) (gaimed gun1) (gaimto gun1 tar2)
   goals met: 4 of 6
18. (kag tar2 gun1)
   deleted: (gaimed gun1) (gaimto gun1 tar2)
   added: (fired gun1) (destroyed tar2)
   goals met: 5 of 6
19. (ghand_off gun1 sti1 tar2)
   deleted: (gsurvice gun1 sti1) (locked sti1) (lockon sti1 tar2) (fired gun1)
   goals met: 6 of 6
